IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_cputimer_regs.xml
<module id="CM_CPUTIMER_REGS" HW_revision="" description="CM CPUTIMER Registers">
	<register id="TIM" width="32" page="1" offset="0x0" internal="0" description="Timer counter register">
		<bitfield id="COUNT" description="Timer counter" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PRD" width="32" page="1" offset="0x4" internal="0" description="Timer period register">
		<bitfield id="PRD" description="Timer Period" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TCR" width="32" page="1" offset="0x8" internal="0" description="Timer control register">
		<bitfield id="TSS" description="Timer Stop Status" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRB" description="Timer Reload Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOFT" description="SOFT stop enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="FREE" description="Free run enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TIE" description="Timer Interrupt Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TIF" description="Timer Intrerrupt Flag" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="TPR" width="32" page="1" offset="0xc" internal="0" description="Timer prescaler register">
		<bitfield id="TDDRL" description="Timer Divide Down Register Low" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="PSCL" description="Prescaler Counter low" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="TDDRH" description="Timer Divide Down Register High" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="PSCH" description="Prescaler Counter high" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
</module>
